-- ===========================================================================
-- Модуль `config.monitor_settings`
--
-- Содержит константы и конфигурации, используемые в системе мониторинга.
-- Включает сопоставления IP-адресов с именами потоков или локациями
-- для более читаемого представления в мониторинге.
-- ===========================================================================
-- 1. Стандартные Lua функции
-- Нет стандартных Lua функций в этом модуле

-- 2. Функции из ModuleManager.get_module()
-- Нет функций из ModuleManager.get_module() в этом модуле

-- 3. Глобальные зависимости Astra из ModuleManager.get_global_dependency()
-- Нет глобальных зависимостей Astra в этом модуле

-- 4. Константы и конфигурации
--- @type table<string, string>
local STREAM = {
    ["127.0.0.1"] = "Узда",
    ["127.0.0.2"] = "Дружный",
    ["127.0.0.3"] = "Старобин",
    ["127.0.0.4"] = "Октябрьский",
    ["127.0.0.5"] = "Червень",
    ["127.0.0.6"] = "Mediatech",
    ["127.0.0.7"] = "PlayOut",
    ["127.0.0.8"] = "BeCloud",
    ["127.0.0.9"] = "WikiLink",
}

--- @type table<string, table>
local MONIT_ADDRESS = {
}

-- 5. Инициализация объектов из загруженных модулей
-- Нет объектов для инициализации в этом модуле

return {
    STREAM        = STREAM,
    MONIT_ADDRESS = MONIT_ADDRESS
}
